IdeaRS.OpenModel.CoordinateSystemMethod
A system which uses one or more numbers, or coordinates, to uniquely determine the position of a point or other geometric element.

IdeaRS.OpenModel.CoordinateSystemMethod.Cartesian
The Cartesian coordinate system.

IdeaRS.OpenModel.CoordinateSystemMethod.Polar
The polar coordinate system.